; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v13 ?v11)
             (pred_8 ?v8 ?v9)
             (pred_5 ?v13 ?v9)
             (pred_6 ?v12 ?v13 )
	     (pred_9 ?v13)
             (pred_11 ?v3)
             (pred_7 ?v8)
             (pred_1 ?v9)
             (pred_4 ?v13)
             (pred_12 ?v8)
             (pred_10 ?v13)
             (pred_3 ))



(:action op_2
:parameters (?v5 ?v1 ?v10 ?v7)
:precondition (and (pred_11 ?v5) (pred_11 ?v1) (pred_7 ?v10) (pred_1 ?v7)
          (pred_2 ?v5 ?v1) (pred_8 ?v10 ?v7)
                   (pred_5 ?v1 ?v7) (pred_9 ?v5) 
                   (pred_4 ?v1) (pred_12 ?v10))
:effect (and  (pred_10 ?v1) (not (pred_4 ?v1))))


(:action op_1
:parameters (?v5 ?v6)
:precondition (and (pred_11 ?v5) (pred_11 ?v6)
               (pred_9 ?v5) (pred_2 ?v5 ?v6) (pred_10 ?v6))
:effect (and (pred_9 ?v6) (not (pred_9 ?v5))))

(:action op_3
:parameters (?v5 ?v10)
:precondition (and (pred_11 ?v5) (pred_7 ?v10) 
                  (pred_9 ?v5) (pred_6 ?v10 ?v5) (pred_3 ))
:effect (and (pred_12 ?v10)
   (not (pred_6 ?v10 ?v5)) (not (pred_3 ))))


(:action op_4
:parameters (?v5 ?v2 ?v4)
:precondition (and (pred_11 ?v5) (pred_7 ?v2) (pred_7 ?v4)
                  (pred_9 ?v5) (pred_12 ?v4) (pred_6 ?v2 ?v5))
:effect (and (pred_12 ?v2) (pred_6 ?v4 ?v5)
        (not (pred_12 ?v4)) (not (pred_6 ?v2 ?v5))))

(:action op_5
:parameters (?v5 ?v10)
:precondition (and (pred_11 ?v5) (pred_7 ?v10) 
                  (pred_9 ?v5) (pred_12 ?v10))
:effect (and (pred_3 ) (pred_6 ?v10 ?v5) (not (pred_12 ?v10)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_25 obj_16 obj_24 obj_09 obj_13 obj_30 obj_19 obj_21 obj_27 obj_29 obj_08 obj_32 obj_02 obj_15 obj_20 obj_12 obj_26 obj_22 obj_07 obj_14 obj_31 obj_28 obj_17 obj_18 obj_05
    obj_11 obj_01 obj_04
    obj_03 obj_06 obj_10 obj_23
    )

    (:init
       (pred_3)

       (pred_11 obj_25)
       (pred_11 obj_16)
       (pred_11 obj_24)
       (pred_11 obj_09)
       (pred_11 obj_13)
       (pred_11 obj_30)
       (pred_11 obj_19)
       (pred_11 obj_21)
       (pred_11 obj_27)
       (pred_11 obj_29)
       (pred_11 obj_08)
       (pred_11 obj_32)
       (pred_11 obj_02)
       (pred_11 obj_15)
       (pred_11 obj_20)
       (pred_11 obj_12)
       (pred_11 obj_26)
       (pred_11 obj_22)
       (pred_11 obj_07)
       (pred_11 obj_14)
       (pred_11 obj_31)
       (pred_11 obj_28)
       (pred_11 obj_17)
       (pred_11 obj_18)
       (pred_11 obj_05)
       (pred_1 obj_11)
       (pred_1 obj_01)
       (pred_1 obj_04)
       (pred_7 obj_03)
       (pred_7 obj_06)
       (pred_7 obj_10)
       (pred_7 obj_23)

       (pred_2 obj_25 obj_30)
       (pred_2 obj_25 obj_16)
       (pred_2 obj_16 obj_19)
       (pred_2 obj_16 obj_24)
       (pred_2 obj_16 obj_25)
       (pred_2 obj_24 obj_21)
       (pred_2 obj_24 obj_09)
       (pred_2 obj_24 obj_16)
       (pred_2 obj_09 obj_27)
       (pred_2 obj_09 obj_13)
       (pred_2 obj_09 obj_24)
       (pred_2 obj_13 obj_29)
       (pred_2 obj_13 obj_09)
       (pred_2 obj_30 obj_08)
       (pred_2 obj_30 obj_19)
       (pred_2 obj_30 obj_25)
       (pred_2 obj_19 obj_32)
       (pred_2 obj_19 obj_21)
       (pred_2 obj_19 obj_16)
       (pred_2 obj_19 obj_30)
       (pred_2 obj_21 obj_02)
       (pred_2 obj_21 obj_27)
       (pred_2 obj_21 obj_24)
       (pred_2 obj_21 obj_19)
       (pred_2 obj_27 obj_15)
       (pred_2 obj_27 obj_29)
       (pred_2 obj_27 obj_09)
       (pred_2 obj_27 obj_21)
       (pred_2 obj_29 obj_20)
       (pred_2 obj_29 obj_13)
       (pred_2 obj_29 obj_27)
       (pred_2 obj_08 obj_12)
       (pred_2 obj_08 obj_32)
       (pred_2 obj_08 obj_30)
       (pred_2 obj_32 obj_26)
       (pred_2 obj_32 obj_02)
       (pred_2 obj_32 obj_19)
       (pred_2 obj_32 obj_08)
       (pred_2 obj_02 obj_22)
       (pred_2 obj_02 obj_15)
       (pred_2 obj_02 obj_21)
       (pred_2 obj_02 obj_32)
       (pred_2 obj_15 obj_07)
       (pred_2 obj_15 obj_20)
       (pred_2 obj_15 obj_27)
       (pred_2 obj_15 obj_02)
       (pred_2 obj_20 obj_14)
       (pred_2 obj_20 obj_29)
       (pred_2 obj_20 obj_15)
       (pred_2 obj_12 obj_31)
       (pred_2 obj_12 obj_26)
       (pred_2 obj_12 obj_08)
       (pred_2 obj_26 obj_28)
       (pred_2 obj_26 obj_22)
       (pred_2 obj_26 obj_32)
       (pred_2 obj_26 obj_12)
       (pred_2 obj_22 obj_17)
       (pred_2 obj_22 obj_07)
       (pred_2 obj_22 obj_02)
       (pred_2 obj_22 obj_26)
       (pred_2 obj_07 obj_18)
       (pred_2 obj_07 obj_14)
       (pred_2 obj_07 obj_15)
       (pred_2 obj_07 obj_22)
       (pred_2 obj_14 obj_05)
       (pred_2 obj_14 obj_20)
       (pred_2 obj_14 obj_07)
       (pred_2 obj_31 obj_28)
       (pred_2 obj_31 obj_12)
       (pred_2 obj_28 obj_17)
       (pred_2 obj_28 obj_26)
       (pred_2 obj_28 obj_31)
       (pred_2 obj_17 obj_18)
       (pred_2 obj_17 obj_22)
       (pred_2 obj_17 obj_28)
       (pred_2 obj_18 obj_05)
       (pred_2 obj_18 obj_07)
       (pred_2 obj_18 obj_17)
       (pred_2 obj_05 obj_14)
       (pred_2 obj_05 obj_18)
       (pred_4 obj_13)
       (pred_4 obj_20)
       (pred_4 obj_26)
       (pred_4 obj_09)
       (pred_5  obj_13 obj_11)
       (pred_5  obj_20 obj_01)
       (pred_5  obj_26 obj_04)
       (pred_5  obj_09 obj_11)
       (pred_10 obj_25)
       (pred_10 obj_16)
       (pred_10 obj_24)
       (pred_10 obj_30)
       (pred_10 obj_19)
       (pred_10 obj_21)
       (pred_10 obj_27)
       (pred_10 obj_29)
       (pred_10 obj_08)
       (pred_10 obj_32)
       (pred_10 obj_02)
       (pred_10 obj_15)
       (pred_10 obj_12)
       (pred_10 obj_22)
       (pred_10 obj_07)
       (pred_10 obj_14)
       (pred_10 obj_31)
       (pred_10 obj_28)
       (pred_10 obj_17)
       (pred_10 obj_18)
       (pred_10 obj_05)

       (pred_8  obj_03 obj_11)
       (pred_8  obj_06 obj_01)
       (pred_8  obj_10 obj_04)
       (pred_8  obj_23 obj_04)
       (pred_6 obj_03 obj_17)
       (pred_6 obj_06 obj_30)
       (pred_6 obj_10 obj_19)
       (pred_6 obj_23 obj_28)
       (pred_9 obj_30)
    )

    (:goal (and
       (pred_6 obj_06 obj_31)
       (pred_6 obj_10 obj_14)
       (pred_6 obj_23 obj_15)
    ))
(:constraints
  (always (not (pred_9 obj_21)))
)
)

; plan
1. (op_3 obj_30 obj_06)
   deleted: (pred_6 obj_06 obj_30) (pred_3)
   added: (pred_12 obj_06)
   goals met: 0 of 3
2. (op_1 obj_30 obj_08)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_08)
   goals met: 0 of 3
3. (op_1 obj_08 obj_12)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_12)
   goals met: 0 of 3
4. (op_1 obj_12 obj_31)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_31)
   goals met: 0 of 3
5. (op_5 obj_31 obj_06)
   deleted: (pred_12 obj_06)
   added: (pred_3) (pred_6 obj_06 obj_31)
   goals met: 1 of 3
6. (op_1 obj_31 obj_12)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_12)
   goals met: 1 of 3
7. (op_1 obj_12 obj_08)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_08)
   goals met: 1 of 3
8. (op_1 obj_08 obj_32)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_32)
   goals met: 1 of 3
9. (op_1 obj_32 obj_19)
   deleted: (pred_9 obj_32)
   added: (pred_9 obj_19)
   goals met: 1 of 3
10. (op_3 obj_19 obj_10)
   deleted: (pred_6 obj_10 obj_19) (pred_3)
   added: (pred_12 obj_10)
   goals met: 1 of 3
11. (op_1 obj_19 obj_32)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_32)
   goals met: 1 of 3
12. (op_1 obj_32 obj_02)
   deleted: (pred_9 obj_32)
   added: (pred_9 obj_02)
   goals met: 1 of 3
13. (op_1 obj_02 obj_15)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_15)
   goals met: 1 of 3
14. (op_1 obj_15 obj_07)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_07)
   goals met: 1 of 3
15. (op_1 obj_07 obj_14)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_14)
   goals met: 1 of 3
16. (op_5 obj_14 obj_10)
   deleted: (pred_12 obj_10)
   added: (pred_3) (pred_6 obj_10 obj_14)
   goals met: 2 of 3
17. (op_1 obj_14 obj_07)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_07)
   goals met: 2 of 3
18. (op_1 obj_07 obj_22)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_22)
   goals met: 2 of 3
19. (op_1 obj_22 obj_17)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_17)
   goals met: 2 of 3
20. (op_1 obj_17 obj_28)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_28)
   goals met: 2 of 3
21. (op_3 obj_28 obj_23)
   deleted: (pred_6 obj_23 obj_28) (pred_3)
   added: (pred_12 obj_23)
   goals met: 2 of 3
22. (op_1 obj_28 obj_17)
   deleted: (pred_9 obj_28)
   added: (pred_9 obj_17)
   goals met: 2 of 3
23. (op_1 obj_17 obj_22)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_22)
   goals met: 2 of 3
24. (op_1 obj_22 obj_02)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_02)
   goals met: 2 of 3
25. (op_1 obj_02 obj_15)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_15)
   goals met: 2 of 3
26. (op_5 obj_15 obj_23)
   deleted: (pred_12 obj_23)
   added: (pred_3) (pred_6 obj_23 obj_15)
   goals met: 3 of 3
